app/Controllers/Api/SectionController.php

    public function roster(int $sectionId)
    {
        $items = db_connect()->table('section_members sm')
            ->select('u.id, u.first_name, u.last_name, u.email, u.student_no, u.role')
            ->join('users u', 'u.id = sm.user_id')
            ->where('sm.section_id', $sectionId)
            ->where('sm.is_current', 1)
            ->orderBy('u.last_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `u`.`id`, `u`.`first_name`, `u`.`last_name`, `u`.`email`, `u`.`student_no`, `u`.`role`
FROM `section_members` `sm`
JOIN `users` `u` ON `u`.`id` = `sm`.`user_id`
WHERE `sm`.`section_id` = 1
AND `sm`.`is_current` = 1
ORDER BY `u`.`last_name` ASC