app/Controllers/AdminController.php

    public function cashFlow(): string { return view('pages/admin/cash-flow', ['entries' => (new CashFlowEntryModel())->where('organization_id', session()->get('org_id'))->orderBy('occurred_on', 'DESC')->findAll()]); }
---
SELECT *
FROM `cash_flow_entries`
WHERE `organization_id` = '1'
AND `cash_flow_entries`.`deleted_at` IS NULL
ORDER BY `occurred_on` DESC

    public function users(): string { return view('pages/admin/users', ['users' => (new UserModel())->where('organization_id', session()->get('org_id'))->findAll()]); }
---
SELECT *
FROM `users`
WHERE `organization_id` = '1'
AND `users`.`deleted_at` IS NULL