app/Models/AnnouncementModel.php

    public function getActive(int $orgId): array
    {
        return $this->where('organization_id', $orgId)
            ->where('is_active', 1)
            ->groupStart()
                ->where('ends_at IS NULL')
                ->orWhere('ends_at >=', date('Y-m-d H:i:s'))
            ->groupEnd()
            ->orderBy('posted_at', 'DESC')
            ->findAll(20);
---
SELECT *
FROM `announcements`
WHERE `organization_id` = 1
AND `is_active` = 1
AND   (
`ends_at` IS NULL
OR `ends_at` >= '2026-05-23 04:38:41'
 )
AND `announcements`.`deleted_at` IS NULL
ORDER BY `posted_at` DESC
 LIMIT 20