app/Models/FeeModel.php

    public function getActiveFees(int $orgId): array
    {
        return $this->where('organization_id', $orgId)
            ->whereIn('status', ['active', 'draft'])
            ->findAll();
---
SELECT *
FROM `fees`
WHERE `organization_id` = 1
AND `status` IN ('active','draft')
AND `fees`.`deleted_at` IS NULL