app/Models/NotificationModel.php

    public function getUnread(int $userId): array
    {
        return $this->where('user_id', $userId)
            ->where('read_at IS NULL')
            ->orderBy('created_at', 'DESC')
            ->findAll(50);
---
SELECT *
FROM `notifications`
WHERE `user_id` = 11
AND `read_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 50