app/Models/PaymentModel.php

SELECT *
FROM `payments`
WHERE `organization_id` = 1
AND `status` = 'pending'
AND `payments`.`deleted_at` IS NULL
---
    public function getPending(int $orgId): array
    {
        return $this->where('organization_id', $orgId)
            ->where('status', 'pending')
            ->findAll();