app/Models/SectionModel.php

SELECT `s`.*, `u`.`first_name`, `u`.`last_name`, `u`.`email` AS `treasurer_email`
FROM `sections` `s`
LEFT JOIN `users` `u` ON `u`.`id` = `s`.`treasurer_id`
WHERE `s`.`organization_id` = 1
AND `s`.`status` = 'active'
AND `s`.`deleted_at` IS NULL
---
    public function getWithTreasurer(int $orgId): array
    {
        return $this->db->table('sections s')
            ->select('s.*, u.first_name, u.last_name, u.email AS treasurer_email')
            ->join('users u', 'u.id = s.treasurer_id', 'left')
            ->where('s.organization_id', $orgId)
            ->where('s.status', 'active')
            ->where('s.deleted_at', null)
            ->get()
            ->getResultArray();